## Plan Result (user-list-search-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/10780955954)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 2 to add, 4 to change, 1 to destroy.</code></pre>

* Create
  * module.corpus_embeddings.aws_iam_role_policy.snapshot_access_policy_attachment
* Update
  * aws_iam_role_policy.corpus_events_hydration_lambda_execution_policy
  * aws_iam_role_policy.corpus_events_lambda_execution_policy
  * aws_iam_role_policy.snapshot_access_policy_attachment
  * module.corpus_embeddings.aws_opensearch_domain.corpus_search[0]
* Replace
  * aws_ecs_task_definition.apollo



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.apollo must be replaced
+/- resource "aws_ecs_task_definition" "apollo" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo:579" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  - environment            = []
                  - mountPoints            = []
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - cpu                    = 0
                  ~ environment            = [
                        # (6 unchanged elements hidden)
                        {
                            name  = "CORPUS_INDEX_IT"
                            value = "corpus_it"
                        },
                      + {
                          + name  = "CORPUS_SEARCH_DOMAIN"
                          + value = "corpusembeddings-prod"
                        },
                      + {
                          + name  = "CORPUS_SEARCH_ENDPOINT"
                          + value = "vpc-corpusembeddings-prod-xmtxj7lpdwwpi2w7l2zt2i256m.us-east-1.es.amazonaws.com"
                        },
                        {
                            name  = "ELASTICSEARCH_DOMAIN"
                            value = "userlistsearch-prod-v2"
                        },
                        # (1 unchanged element hidden)
                        {
                            name  = "ELASTICSEARCH_INDEX"
                            value = "list"
                        },
                      + {
                          + name  = "EMBEDDINGS_ENDPOINT"
                          + value = "CorpusEmbeddings-Prod-ep-mltvhddp"
                        },
                        {
                            name  = "EVENT_BUS_NAME"
                            value = "PocketEventBridge-Prod-Shared-Event-Bus"
                        },
                        # (4 unchanged elements hidden)
                    ]
                  - mountPoints            = []
                    name                   = "node"
                  - systemControls         = []
                  - volumesFrom            = []
                    # (6 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "UserListSearch-Prod-Apollo" -> (known after apply)
      ~ revision                 = 579 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket"
            "component_code" = "pocket-userlistsearch"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "UserListSearch"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_iam_role_policy.corpus_events_hydration_lambda_execution_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "corpus_events_hydration_lambda_execution_policy" {
        id          = "UserListSearch-Prod-CorpusParserHydratorLambdaExecutionRole:UserListSearch-Prod-CorpusParserHydratorAccessPolicy"
        name        = "UserListSearch-Prod-CorpusParserHydratorAccessPolicy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "sqs:SendMessageBatch",
                            "sqs:SendMessage",
                            "sqs:ReceiveMessage*",
                            "sqs:GetQueueAttributes",
                            "sqs:DeleteMessage*",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:sqs:us-east-1:996905175585:UserListSearch-Prod-CorpusParserHydrator"
                    },
                  ~ {
                      ~ Resource = [
                          ~ "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/corpus_it/_bulk" -> "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_it/_bulk",
                          ~ "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/corpus_fr/_bulk" -> "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_fr/_bulk",
                          ~ "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/corpus_es/_bulk" -> "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_es/_bulk",
                          ~ "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/corpus_en/_bulk" -> "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_en/_bulk",
                          ~ "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/corpus_de/_bulk" -> "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_de/_bulk",
                          ~ "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/_bulk" -> "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/_bulk",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                  + {
                      + Action   = [
                          + "sagemaker:InvokeEndpointAsync",
                          + "sagemaker:InvokeEndpoint",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sagemaker:us-east-1:996905175585:endpoint/CorpusEmbeddings-Prod-ep-mltvhddp"
                    },
                    {
                        Action   = "ssm:GetParameter*"
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:ssm:us-east-1:996905175585:parameter/UserListSearch/Prod/*",
                            "arn:aws:ssm:us-east-1:996905175585:parameter/UserListSearch/Prod",
                        ]
                    },
                    # (2 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.corpus_events_lambda_execution_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "corpus_events_lambda_execution_policy" {
        id          = "UserListSearch-Prod-CorpusEventsLambdaExecutionRole:UserListSearch-Prod-CorpusEventsAccessPolicy"
        name        = "UserListSearch-Prod-CorpusEventsAccessPolicy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "sqs:SendMessageBatch",
                            "sqs:SendMessage",
                            "sqs:ReceiveMessage*",
                            "sqs:GetQueueAttributes",
                            "sqs:DeleteMessage*",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:sqs:us-east-1:996905175585:UserListSearch-Prod-CorpusEvents"
                    },
                  ~ {
                      ~ Resource = [
                          ~ "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/corpus_it/_bulk" -> "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_it/_bulk",
                          ~ "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/corpus_fr/_bulk" -> "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_fr/_bulk",
                          ~ "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/corpus_es/_bulk" -> "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_es/_bulk",
                          ~ "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/corpus_en/_bulk" -> "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_en/_bulk",
                          ~ "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/corpus_de/_bulk" -> "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/corpus_de/_bulk",
                          ~ "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/_bulk" -> "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/_bulk",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = "ssm:GetParameter*"
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:ssm:us-east-1:996905175585:parameter/UserListSearch/Prod/*",
                            "arn:aws:ssm:us-east-1:996905175585:parameter/UserListSearch/Prod",
                        ]
                    },
                    # (2 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.snapshot_access_policy_attachment will be updated in-place
  ~ resource "aws_iam_role_policy" "snapshot_access_policy_attachment" {
        id          = "UserListSearch-Prod-OSManualSnapshotRole:UserListSearch-Prod-OSManualSnapshotS3AccessPolicy"
        name        = "UserListSearch-Prod-OSManualSnapshotS3AccessPolicy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action   = "iam:PassRole"
                        Effect   = "Allow"
                        Resource = "arn:aws:iam::996905175585:role/UserListSearch-Prod-OSManualSnapshotRole"
                    },
                  ~ {
                      ~ Resource = "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/*" -> [
                          + "arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2/*",
                          + "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/*",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.corpus_embeddings.data.aws_iam_policy_document.snapshot_access_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "snapshot_access_policy" {
      + id      = (known after apply)
      + json    = (known after apply)
      + version = "2012-10-17"

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::pocket-corpusembeddings-prod-search-snapshots/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::pocket-corpusembeddings-prod-search-snapshots",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:iam::996905175585:role/CorpusEmbeddings-Prod-OSManualSnapshotRole",
            ]
        }
      + statement {
          + actions   = [
              + "es:ESHttpPut",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod/*",
            ]
        }
    }

  # module.corpus_embeddings.aws_iam_role_policy.snapshot_access_policy_attachment will be created
  + resource "aws_iam_role_policy" "snapshot_access_policy_attachment" {
      + id          = (known after apply)
      + name        = "CorpusEmbeddings-Prod-OSManualSnapshotS3AccessPolicy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "CorpusEmbeddings-Prod-OSManualSnapshotRole"
    }

  # module.corpus_embeddings.aws_opensearch_domain.corpus_search[0] will be updated in-place
  ~ resource "aws_opensearch_domain" "corpus_search" {
        id                 = "arn:aws:es:us-east-1:996905175585:domain/corpusembeddings-prod"
        tags               = {
            "app_code"       = "pocket"
            "component_code" = "pocket-corpusembeddings"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "CorpusEmbeddings"
        }
        # (10 unchanged attributes hidden)

      ~ auto_tune_options {
          ~ rollback_on_disable = "NO_ROLLBACK" -> "DEFAULT_ROLLBACK"
            # (2 unchanged attributes hidden)
        }

        # (13 unchanged blocks hidden)
    }

Plan: 2 to add, 4 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo:579" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":724,"Program":"tfcmt","SHA1":"eb6ac4408c9093f2970feb9fdc6d31f2a0d36658","Target":"user-list-search-production","Vars":{},"WorkflowName":"User List Search"} -->